{"pageProps":{"post":{"id":"four-thousand-weeks","title":"Four Thousand Weeks","category":"book summary","description":"Four Thousand Weeks Summary","type":"books","date":"Sat Jul 09 2022","contentHtml":"<h3>In the Long Run, We're All Dead</h3>\n<p>The average person lives 4000 weeks</p>\n<p>we've been granted the mental capacities to make almost infinitely ambitious plans yet practically no time at all to put them into action</p>\n<h5>Life on the Conveyor Belt</h5>\n<p>\"Busyness\" has been rebranded as \"hustle\" - relentless work not as a burden to be endured but as an exhilarating lifestyle choice worth boasting about on social media.</p>\n<p>Time feels like an unstoppable conveyor belt that brings us new tasks as fast as we can dispatch the old ones. Becoming \"more productive\" just seems to cause the belt to speed up or eventually break down.</p>\n<h5>On Getting the Wrong Things Done</h5>\n<p>Despite our \"busyness\", even the privileged among us rarely get around to doing the right things.</p>\n<p>Yearning for meaning can take many forms - devoting yourself to a larger cause, speing more time with your children or in nature.</p>\n<p>Our days are spent trying to \"get through\" tasks in order to get them \"out of the way\" so we can finally get around to what really matters.</p>\n<p>The spirit of the times is one of joyless urgency.</p>\n<p>Productivity is a trap - becoming more efficient just makes you more rushed and trying to clear the decks simply makes them fill up again faster.</p>\n<h3>The Limit-Embracing Life</h3>\n<p>The problem isn't limited time but that we are pressured to live by a set of ideas about how to use our limited time.</p>\n<p>When there are too many activities to fit comfortably into containers, we feel unpleasantly busy; when there are too few, we feel bored. If we keep pace with the passing containers, we congratulate ourselves for \"staying on top of things\" and feel like we're justifying our existence; if we let too many pass by unfilled, we feel we've wasted them.</p>\n<p>Farmers in medieval times didn't have clocks, they lived via task orientation - the rhythms of life emerge organically from the tasks themselves rather than being lined up against an abstract timeline. The clock does not stop, but we do not hear it ticking. Babies live via task orientation as well - they sleep when sleepy, eat when hungry.</p>\n<p>Time is needed when you want to coordinate actions of people. Clocks were invented by medieval monks when needed some way of ensuring the whole monestary woke up at to begin their morning prayers.</p>\n<p>The industrial revolution made time a thing that you used. It becomes difficult not to value each moment primarily according to its usefulness for some future goal.</p>\n<p>Most of us invest a lot of energy in trying to avoid fully experiencing the reality in which we find ourselves. We don't want to feel the anxiety that might arise if we were to ask ourselves whether we're on the right path or what ideas about ourselves it could be time to give up on.</p>\n<p>We labour at our daily work more ardently and thoughtlessly than is necessary to sustain our life because to us it is even more necessary not to have leasure to stop and think. Haste is universal because everyone is in flight from himself.</p>\n<p>We plan compulsively to avoid confronting how little control over the future we really have.</p>\n<p>Organize your time with the understanding that you definitely won't have time for everything you want to do or that other people want you to do.</p>\n<p>Approach life not as an opportunity to implement your predetermined plans for success but as a matter of responding to the needs of your place and your moment in history.</p>\n<h3>The Efficiency Trap</h3>\n<p>The problem with trying to make time for everything that feels important is that you definitely never will.</p>\n<p>When people got access to \"labor-saving\" devices like washing machines and vacuum cleaners, no time was saved at all because societies standards of cleanliness rose.</p>\n<p>Parkinson's Law: work expands so as to fill the time available for its completion</p>\n<p>You could in principle receive infinite emails, but you can only read or reply to a finite number of emails. Every time you reply to an email, there is a good chance you will receive a reply back; more people will also consider it worth their while to email someone who is known to reply promptly.</p>\n<p>The benefits of rendering yourself more efficient will be offset by the demands of more things to do. The more efficient you get, the more you become a limitless reservoir for other people's expectations.</p>\n<p>The modern world provides an inexhaustable supply of things that seem worth doing, and so there arises an inevitable and unbridgeable gap between what you'd ideally like to do and what you actually can do.</p>\n<p>Focus on items of greatest consequence while tolerating the discomfort of knowing that other errands will pile up, some of which you might never get to.</p>\n<p>Convenience (uber, apple pay, food delivery) makes things easy but without regard to whether easiness is truly what's most valuable in any given context (lack of community, social interactions). When sending a birthday card, it isn't the thought that counts, but the effort/inconvenience (physical vs digital). When things are made more convenient you drain it of its meaning.</p>\n<p>Self-conscious inconvenience can lead to a more meaningful life.</p>\n<p>Convenience culture seduces us into imagining we might find room for everything import by eliminating only life's tedious tasks but the added efficiencies just lead to more errands.</p>\n<h3>Facing Finitude</h3>\n<p>A decision to do any given thing will automatically mean sacrificing an inifite number of potential alternative paths. As you make hundreds of small choices throughout the day, you are building a life but also closing off the possibility of countless others.</p>\n<p>\"decide\" is latin for \"cut off\".</p>\n<p>Every choice requires sacrifice</p>\n<p>If your whole life is borrowed time, then wouldn't it make sense to speak not of having to make choices but of getting the opportunity to make them?</p>\n<h3>Becoming a Better Procrastinator</h3>\n<p>The core challenge of managing our limited time isn't about how to get everything done but how to decide wisely what <em>not</em> to do and how to feel at peace about not doing it.</p>\n<p>When you get to the end of your life, you'll have gotten around to doing virtually none of the things you theoretically could have done.</p>\n<p>The real problem with time management isn't that we are bad at prioritizing the big things; it's that there are too many little things.</p>\n<p>Always \"pay yourself first\". Find time for your most valued activity, regardless of the consequences. There is no moment in the future when you'll magically be done with everything and have loads of free time.</p>\n<p>Limit your \"work in progress\". Only take on at most three tasks.</p>\n<p>Make a list of 25 things you want to accomplish in life in priority order. Anything not in the top 5 should be actively avoided at all costs. In a world of too many competing priorities, its the moderately appealing ones - the fairly interesting job opportunity, the semi-enjoyable friendship - on which a finite life can come to grief. You need to learn how to start saying no to things you <em>do</em> want to do, with the recognition that you only have one life.</p>\n<p>We only live one life - we feel tension between work and family, a day job and a creative calling, a hometown and a big city. We prefer indecision over committing ourselves to a single path. To live is to make choices.</p>\n<p>When you fantasize, you can live all those lives perfectly in parallel. In real life, you are forced to make tradeoffs and will inevitably prove disappointing by comparison.</p>\n<p>Striving requires settling - you can't be an ultrasuccessful lawyer, artist, or politician without first \"settling\" on low, art, or politics. A relationship can't be truly fulfilling unless you're willing to settle for that specific relationship.</p>\n<p>The real probably in relationships is that the other person is just one other person - the difficulties aren't that your partner is especially flawed or that the two of you are especially incompatible - but that you are learning that your partner is finite and thus deeply disappointing by comparison with your fantasies.</p>\n<p>The future is more appealing that the present because you get to indulge in all your hopes for it, even if they contradict each other.</p>\n<p>When you consciously make a committment, you are closing off your fantasies of inifite possibility and forward into the consequences of your choice.</p>\n<h3>The Watermelon Problem</h3>\n<p>45 minute BuzzFeed video of people putting elastic bands on a watermelon until it explodes.</p>\n<p>No one wakes up with the intention of using a portion of their lives to watch a watermelon burst.</p>\n<p>Your experience of being alive consists of nothing other than the sum of everything to which you pay attention.</p>\n<p>The distracted person isn't choosing at all - their attention has been commandeered by forces that don't have their highest priorities at heart.</p>\n<h3>The Intimate Interrupter</h3>\n<p>The more intensely one could hold their attention the experiences of whatever they are doing, the clearer it becomes that the real problem is not the activity itself but your internal resistence to experiencing it.</p>\n<p>Why are we so uncomfortable concentrating on things that matter that we'd rather flee into distraction which, by definition, are what we <em>don't</em> want to be doing with our lives.</p>\n<p>Distractions make you feel unconstrained and are where we go to seek relief from the discomfort of confronting limitations.</p>\n<h3>We Never Really Have Time</h3>\n<p>Hofstadters Law: Any task you plan to tackle will always take longer than you expect. Even if you know a project will overrun and you adjust the schedule, it'll just overrun the new estimated finishing time too.</p>\n<ul>\n<li>Government of New South Wales know construction projects overrun so they gave a large four year estimate for the Sydney Opera House. It took fourteen years.</li>\n</ul>\n<p>The obsessive planner is demanding certain reassurances from the future but the future isn't the sort of thing that can ever provide the reassurance he craves.</p>\n<p>Worry, at its core, is the repetitious experience of a mind attempting to generate a feeling of security about the future, failing, then trying again and again - as if the act of worrying might somehow forestall the future.</p>\n<p>You will never be in a position to use your time precisely as you wish. Instead, you find yourself in each moment as it comes. Time is not in our possession and cannot be brought under our control.</p>\n<p>Planning is good but understand that the source of anxiety is the uncertainty of whether those plans will come to fruition.</p>\n<p>Anxiety around the unpredictability of the future can be alleviated by reflecting on the unplanned chance occurences of the past that lead to the present moment. A thousand different futures may have stemmed from every single moment of your past.</p>\n<p>The things you value most in life came to pass thanks to circumstances you never chose.</p>\n<p>Tao Te Ching - Trying to control the future is like trying to take the master carpenter's place.</p>\n<p>Geshe Shawopa - Do not rule over imaginary kingdoms of endlessly proliferating possibilities.</p>\n<p>Sermon of the mount - take no thought for the morrow, for the morrow shall take thought for the things of itself.</p>\n<p>Sufficient to the day is the evil thereof. Are your days so problem-free that you have time to be anxious about invented problems in the future?</p>\n<p>Joseph Goldstein - a plan is just a thought. All a plan can be is a present-moment statement of intent.</p>\n<h3>You Are Here</h3>\n<p>We tend to treat the present as some path to some superior future state (work hard now so we can do xyz later). We treat everything we're doing as valuable only insofar as it lays the groundwork for something else.</p>\n<p>Alexander Herzen - nature doesn't disdain what only lives for a day. It purs the whole of itself into each moment. Life's bounty is in its flow. Later is too late.</p>\n<p>Sam Harris - our lives are full of activities that we are doing for the last time. We should treat each moment with the reverence we'd show if it were the final instance of it.</p>\n<p>Living in the moment is a matter of finally realizing that you never had any other option but to be here now.</p>\n<h3>Rediscovering Rest</h3>\n<p>Why should we have to justify life in terms of the economy?</p>\n<p>The problem with treating time solely as something to be used as well as possible is that we start to experience pressure to use our leisure time productively too</p>\n<p>Aristotle - true leisure - self-reflection and philosophical contemplation - was the very highest of virtues because it was worth choosing for its own sake whereas other tasks were virtuous only because they led to something else</p>\n<p>Industrialization led to the delinearization of work and leisure</p>\n<p>Rest that doesnt have instrumental value (that doesn't create some value for the future) feels wasteful</p>\n<p>Thomas Wolfe - we are the sum of all the moments of our lives</p>\n<p>Mortality makes it impossible to ignore the absurdity of living solely for the future</p>\n<p>Our ceaseless pursuit of future fulfillment will never lead to happiness</p>\n<h3>The Impatience Spiral</h3>\n<p>We tend to feel as though it's our right to have things move at the speed we desire, and the result is that we make ourselves miserable - not just because we spend so much time feeling frustrated, but because chivying the world to move faster is frequently counter-productive anyway. For example, traffic research long ago established that impatient driving behavior tends to slow you down since inching toward the car in front while waiting at a red light means you accelerate more slowly than you otherwise would.</p>\n<p>Virtually every new technology has permitted us to get things done more quickly than before. Shouldn't this therefore have reduced our impatience by allowing us to live at something closer to the sped we'd prefer? Yet since the beginning of the modern era of acceleration, people have been responding not with satisfaction at all the time saved but with increasing agitation that they can't make things move faster still.</p>\n<p>Alcoholism is a result of attempting to exert a level of control over your emotions that you can't ever attain.</p>\n<p>As the world gets faster, we come to believe that our happiness depends on our being able to work and move and make things happen at superhuman speed.</p>\n<h3>Staying on the Bus</h3>\n<p>The capacity to resist the urge to hurry - to allow things to take the time they take - is a way to gain purchase on the world, to do the work that counts, and to derive satisfaction from the doing itself, instead of deferring all your fulfillment to the future.</p>\n<p>If you are willing to endure the discomfort of not knowing, a solution will often present itself.</p>\n<p>We're made so uneasy by the experience of allowing reality to unforld at its own speed that when we're faced with a problem, it feels better to race toward a resolution so we can tell ourselves we're 'dealing with' the situation thereby maintaining a sense of control.</p>\n<p>A problem is just something that demands your attention. If you had no problems, you would have nothing worth doing, and life would be meaningless. Life is a process of engaging with problem after problem. A problem isn't an impediment to a meaningful existence but the very substance of one.</p>\n<p>Embrace radical incrementalism - you probably won't produce much on any given day but if you produce every day, you will produce much more than most in the long term. Be willing to stop when your daily time is up, even if you feel you can get much more done.</p>\n<p>Stay on your path, regardless of setbacks or clones of your work - originality lies on the far side of unoriginality. Truly original work begins only for those who can muster the patience ot immerse themesleves in the earlier stage - the trial-and-error phase of copying others, learning new skills, and accumulating experience. Patiently travel the well-trodden path.</p>\n<h3>The Loneliness of the Digital Nomad</h3>\n"}},"__N_SSG":true}