{"pageProps":{"post":{"id":"the-mind-gut-connection","title":"The Mind-Gut Connection","category":"book summary","description":"The Mind-Gut Connection Summary","type":"notes","date":"Thu Jan 14 2021","contentHtml":"<h3>Role of gut</h3>\n<p>original thought was mouth chewed and swallowed food, stomach mechanically ground it with acid, small intestine received bile to digest fat and digestive enzymes to absorb nutrients, large intestine contract and move contents back and forth to absorb 90% of the water and dispose of remainder.</p>\n<p>gut can influence basic emotions, pain sensitivity, social interactions</p>\n<p>gut has its own nervous system - enteric nervous system</p>\n<p>there are more immune cells in the gut wall than circulating in the blood</p>\n<p>gut lining has endocrine cells that contain/release hormones into the bloodstream</p>\n<p>gut has largest source of serotonin which controls gut contractions, sleep, appetite, pain sensitivity, mood, overall wellbeing. Food, microbes, brain signals influence serotonin release.</p>\n<p>gut has more than 100 trillion microbes, 1000 species, and 7 million genes (360 bacterial genes for every human gene)</p>\n<p>gut microbiome linked to autism, behavioral abnormalities, neurodegenerative diseases like Parkinsons and Alzheimers, depression</p>\n<p>emotions alter gastrointestinal contractions:</p>\n<ul>\n<li>fear decreases stomach contractions but increases intestinal contractions</li>\n<li>anger increases stomach contractions and intestinal contractions</li>\n<li>sadness decreases stomach and intestinal contractions</li>\n</ul>\n<p>majority of patients suffering from abnormal gut reactions reflect their emotional state.</p>\n<p>stress causes hypothalamus to release stress molecule corticotropin-releasing factor which increases cortisol and norepinephrine which causes the gut to contract more, gut wall to become leaky, colon secretes more water and mucus, resulting in diarrhea. CRF peaks in early morning and gradually declines until midday.</p>\n<p>the strength, length, and direction of peristalsis depend on the type of food you have ingested - gut has more time to absorb fat and complex carbs and less for a sugary drink</p>\n<p>between meals, waves move from esophagus to rectum every 90 minutes when there is no food left to digest. This stops as soon as you eat.</p>\n<h3>Stress</h3>\n<p>stress can send signals to stomach and intestines to rid themselves of contents that might otherwise drain energy required for action</p>\n<p>cardio system re-routes blood from the gut to the muscles, slowing digestion and preparing us to fight</p>\n<p>emotional response can linger for hours to years</p>\n<h3>Nervous System Role</h3>\n<p>more than 90% of the sensory information collected by your gut never reaches conscious awareness</p>\n<p>90% = gut to brain, 10% = brain to gut</p>\n<p>gut nervous system:</p>\n<ul>\n<li>strength and direction of gut peristalsis to speed or slow transit of ingested food</li>\n<li>produce the right amount of acid and bile</li>\n<li>gathers info pertaining to the presense and amount of food in the stomach, the size/consistency of the food you swallow, the chemical composition of an ingested meal, presense and activity of gut microbiota</li>\n</ul>\n<p>gut contains phytochemical receptors that are activated by certain specific chemicals in plants\n- when sweet receptors sense glucose or artificial sweeteners, they stimulate the absorption of glucose into the blood stream and the release of insulin from the pancreas, and other hormones to create a sense of satiety\n- bitter receptors stimulate gut to release ghrelin which stimulates appetite</p>\n<p>vagus nerve transmits majority of signals to and from brain</p>\n<h3>Immune System Role</h3>\n<p>Peyer's patches are clusters of immune cells that live primarily in the small intestine and are separated from the gut contents by a tiny layer of cells. Dendritic cells extend through the gut layer, where they can interact with our gut microbes and harmful pathogens. Toll-like receptors on these cells recognize various signals from microbes to keep immune/inflammatory reactions in check.</p>\n<p>thin layer of mucus separates microbes from bacteria. Lipopolysaccharides from gram-negative bacteria can increase leakiness of gut. Excessive dietary fat and low dietary fibre compromises the intestinal layer.</p>\n<p>Immune cells release cytokines that can reach the brain and reduce energy level, increase fatigue and pain sensitivity, and make you depressed.</p>\n<p>Pathogens stimulate water secretion, reverse peristalsis to empty the stomach, accelerate transit through small/large intestine.</p>\n<h3>Endocrine System Role</h3>\n<p>serotonin triggers the peristaltic reflex by activating sensory nerve endings in the vagus nerve. Concentrated serotonin release, such as occurs with food poisoning leads to vomiting and/or intensive bowel movements</p>\n<p>serotonin requires tryptophan. Diets deficient in tryptophan decrease serotonin.</p>\n<p>Enterochromaffin cells are packed with serotonin and are studded with receptors that detect metabolites.</p>\n<h3>Evolution</h3>\n<p>microbes produce chemicals to communicate with one another, hydras = floating digestive tracts that interact with microbes in sea water, evolve to nervous system. We evolved gut first.</p>\n<h3>Nutrition</h3>\n<p>High fat content slows rate of gastric emptying and intestinal transit</p>\n<p>Low caloric density meals speed up stomach emptying to deliver enough calories for absorption</p>\n<p>Stress, inflammation, high-fat foods, and certain food additives can make the gut leaky.</p>\n<h3>Studies</h3>\n<p>ingestion of pribiotic enriched yogurt for four weeks reduce brain response to negative emotional stimuli</p>\n<p>historically excess acid production and peptic ulcer cures involved cutting the vagus nerve, this led to many other symptoms\n- nausea, cramps, vomiting, belly pain, diarrhea</p>\n<p>Gut microbes play an important role in brain-gut interactions. Ancient microbes can produce some of the same hormones and gut peptides that mammals produce.</p>\n<p>Disruption in gut-brain communication impacts gut disorders but also nondigestive disorders like anxiety, depression, and autism.</p>\n<h3>Disorders</h3>\n<p>dysbiosis - mix of gut microbes falls out of its healthy stable state causing several gut disorders\n- antibiotics can cause colitis or gut inflammation since it diminishes the diversity and abundance of normal gut microbiota which allows invasion of C. difficile\n- colon inflammation can be rapidly cured by reestablishing gut microbiome through fecal transplant</p>\n<h3>Thoughts &#x26; Questions</h3>\n<p>refined sugar should be made illegal</p>\n<p>why do antibiotics cause diarrhea? shouldnt removal of microbes lead to undigested food and more bulk?</p>\n<p>do everything/anything to reduce stress</p>\n<p>eat less often</p>\n<p>when eating, concentrate on eating - no distractions</p>\n<p>can meditation improve digestion?</p>\n<p>learn about hormones</p>\n<p>how do antianxiety medications work?</p>\n<p>removing gut microbes can prevent digestion of certain substances which could decrease obesity.</p>\n"}},"__N_SSG":true}