{"pageProps":{"post":{"id":"type-hinting-for-legacy-js-apps","title":"Type Hinting For Legacy Javascript Applications","category":"javascript","description":"Getting the benefits of typescript without adding a compilation step to your toolchain","type":"post","date":"Wed Feb 05 2020","contentHtml":"<p>If you're in the (un)fortunate position of maintaining a legacy javascript application, you may find yourself longing for the benefits of a modern javascript toolchain.</p>\n<p>In this post, we'll look at how we can get some of the benefits of typescript without adding a compilation step to your development workflow.</p>\n<h3>Add type definitions to your dev dependencies</h3>\n<p>Installing type definitions for your dependencies can give you intellisense in editors like vs code regardless of whether you're actually using typescript.</p>\n<p>Before - no autocomplete is available for jquery:\n<img src=\"/images/packagejsonbefore.gif\" alt=\"VS code without type definitions\"></p>\n<p>After - we get intellisense just by installing the type definitions for our dependencies:\n<img src=\"/images/packagejsonafter.gif\" alt=\"VS code with type definitions\"></p>\n<h3>Add a jsconfig.json file</h3>\n<p>Adding a jsconfig.json file gives you some basic type checking which should prevent trivial bugs which would otherwise fly under the radar.</p>\n<p>Before - no method overload checking or variable type re-assignment checking:\n<img src=\"/images/jsconfigbefore.gif\" alt=\"VS code without jsconfig.json\"></p>\n<p>After - we see errors when trying to call methods that don't exist or if we're calling functions with the incorrect number of arguments. Variable type re-assignment also triggers an error:\n<img src=\"/images/jsconfigafter.gif\" alt=\"VS code without jsconfig.json\"></p>\n<h3>Add jsdoc for improved typing</h3>\n<p>If you want to specify types without having to compile your code through <code>tsc</code>, you can use jsdoc.</p>\n<p>Before - function defaults to accepting an argument with <code>any</code> type\n<img src=\"/images/jsdocbefore.gif\" alt=\"VS code without jsdoc\"></p>\n<p>After - function can only accept a string and returns a string array\n<img src=\"/images/jsdocafter.gif\" alt=\"VS code with jsodc\"></p>\n<h3>Run tsc in your ci/cd pipeline</h3>\n<p>Up until now, we were able to reap a bunch of the benefits of typescript without actually using typescript but most of the behavior above comes from vs code. Technically, all of the \"errors\" above are still valid javascript.\nEven if you don't have or want a build step impacting your day-to-day development, you can prevent the above errors from entering your repositories main/trunk by running your code through the typescript compiler via your ci/cd pipeline at merge time.</p>\n<p>Simply run <code>tsc --project jsconfig.json</code>.</p>\n"}},"__N_SSG":true}