{"pageProps":{"post":{"id":"fiction-quotes","title":"Quotes from Fiction","category":"summary","description":"Quotes","type":"notes","date":"Sat Oct 09 2021","contentHtml":"<h3>The Midnight Library</h3>\n<p>Summary:</p>\n<p>Nora Seed attempts suicide and is taken to library where she can live out variations of her life had she made different choices.</p>\n<p>Quotes:</p>\n<p>Maybe even the most seemingly perfectly intense or worthwhile lives ultimately felt the same. Acres of disappointment and monotony and hurts and rivalries but with flashes of wonder and beauty.</p>\n<p>To be human was to continually dumb the world down into an understandable story that keeps things simple</p>\n<p>In chess, as in life, possibility is the basis of everything. Every hope, every dream, every regret, every moment of living.</p>\n<p>We only know what we perceive. Everything we experience is ultimately just our perception of it. It's not what you look at that matters, it's what you see\n.\nNever underestimate the big importance of small things.</p>\n<p>Every life contains many millions of decisions. Some big, some small. But every time one decision is taken over another, the outcomes differ. An irreversible variation occurs, which in turn leads to further variations.</p>\n<p>Life begins on the other side of despair.</p>\n<p>Life sometimes simply gave you a whole new perspective by waiting around long enough to see it.</p>\n<p>You don't need to understand life. You just have to live it.</p>\n<p>The prison wasn't the place, but the perspective.</p>\n<p>Of all the extremely divergent variations of herself she had experienced, the most radical sense of change happened within the exact same life.</p>\n<h3>Snow Crash</h3>\n<p>Summary:</p>\n<p>Mad Max in a cyberpunk future. L Bob Rife is the villian trying to spread a virus/idea to control the population. Hiro Protaganist and YT are the heroes that stop them.</p>\n<p>Quotes:</p>\n<p>We are all susceptible to the pull of viral ideas. Like mass hysteria. Or a tune that gets into your head that you keep humming all day until you spread it to someone else. Jokes. Urban legends. Crackpot religions. Marxism. No matter how smart we get, there is always this deep irrational part that makes us potential hosts for self-replicating information.</p>\n<p>“This Snow Crash thing--is it a virus, a drug, or a religion?”\nJuanita shrugs. “What's the difference?”</p>\n"}},"__N_SSG":true}