{"pageProps":{"post":{"id":"trade-lifecycle","title":"Trade Lifecycle","category":"summary","description":"Udemy course notes","type":"notes","date":"Fri May 20 2022","contentHtml":"<p>Series of steps through which any trade passes. Objective is to have the trade settle by the due date.</p>\n<p>Front office:</p>\n<ul>\n<li>trade execution (buy/sell from counterparty)</li>\n<li>trade capture (trade skeleton should be captured)</li>\n</ul>\n<p>Both front and back office need reference data</p>\n<ul>\n<li>security info</li>\n<li>counterparty info</li>\n</ul>\n<p>Operations:</p>\n<ul>\n<li>\n<p>trade capture</p>\n</li>\n<li>\n<p>trade enrichment</p>\n</li>\n<li>\n<p>trade confirmation (ensure details captured by party/counterparty are agreed upon)</p>\n</li>\n<li>\n<p>settlement instructions (command issued to depository/custodian that will actually authorize the trade settlement)</p>\n</li>\n<li>\n<p>pre-settlement statuses (depository makes sure settlement instructions match)</p>\n</li>\n<li>\n<p>failed settlement (5-10% of trades fail due to non matching instructions)</p>\n</li>\n<li>\n<p>settlement</p>\n</li>\n<li>\n<p>reflecting settlment</p>\n</li>\n<li>\n<p>reconciliation (update local book of record to match depository)</p>\n</li>\n</ul>\n<h3>What is a trade?</h3>\n<p>Legal agreement to buy or sell goods. One party pays cash in exchange for goods, other party receives cash in exchange for goods.</p>\n<p>Parties can be investor &#x26; broker, broker &#x26; exchange, broker &#x26; trader, trader &#x26; trader</p>\n<h3>Trade Execution</h3>\n<p>Historically, between traders on a trading floor where market makers advertise their prices on \"pitches\"</p>\n<p>Currently, automatic execution via electronic exchanges (order-driven markets) or bid/offer prices are quoted to attract investors (quote-driven markets).</p>\n<p>trader uses current trading position + average price of current trading position to determine whether to buy/sell at profit/loss.</p>\n<p>Investment manager makes an investment decision and communicates an \"order\" to executing broker. Broker records detail of the order - client account, buy/sell, quantity, security, desired price.</p>\n<p>When the broker receives the order, it acts as agent (broker attempts to find a third party willing to trade on terms of order - investment bank makes commission <em>only</em>) or principal (trader trades off investment bank trading book). The broker becomes the counterparty to the trade (broker is investors counterparty and investor is broker's counterparty).</p>\n<p>If the trade is made by a fund (ie mutual fund provider), the block level trade needs to be allocated to its underlying funds (splits).</p>\n<h3>Trade Capture</h3>\n<p>Formally recording details of an individual trade immediately after execution. Trade date/time (dividend entitlements is based on trade date), contractual settlement date (the day securities/cash are exchanged), buy/sell, quantity, security, market, price, internal \"owner\" (the trader/advisor), counterparty (entity name + location)</p>\n<p>If counterparty or security reference data is missing, STP between fo system and ops system can't occur and an exception is raised</p>\n<p>A trade is \"open\" until settlement date. Exposure with counterparty exists until settlement date.</p>\n"}},"__N_SSG":true}