{"pageProps":{"post":{"id":"the-managers-path","title":"The Manager's Path","category":"book summary","description":"The Manager's Path Summary","type":"notes","date":"Sat Oct 09 2021","contentHtml":"<h3>Management 101</h3>\n<ul>\n<li>\n<p>good manager - cares about you as a person, actively works to help you grow your career, teaches you important skills, gives you valuable feedback, help navigate difficult situations, helps you understand what is important to focus on, and enables you to have that focus. Identifies and assigns stretch projects to help you grow and learn new things but also help you understand the value of the work you're doing, even when its not fun.</p>\n</li>\n<li>\n<p>one-on-one meetings: create human connection between you and your manager - establish real trust by being vulnerable in front of each other. Don't use one-on-ones as a status meeting. Come prepared with an agenda.</p>\n</li>\n</ul>\n<p>The most mundane work can turn into a source of pride when you understand how it contributes to the overall success of the company.</p>\n<p>As you become more senior, your manager expects you to bring solutions, not problems</p>\n<h3>Mentoring</h3>\n<p>good mentor - discuss projects, whiteboard, pair program. Assists when you're stuck.</p>\n<p>Listen: understand the mentee is probably nervous and trying their best to please you. They may not ask questions when they don't understand things. Get those questions out of him - the odds of you spending all your time answering questions are slim compared to the odds that your intern will go off in the absolute wrong direction because they didnt ask enough questions.</p>\n<p>communicate: Ask them to explain a piece of code to you, point to documents that explain it. Provide nudging and clarity along the way to keep them going in the right direction</p>\n<p>adjust to responses: learn the frequency with which you need to check in with them.</p>\n<p>Mentoring provides the opportunity to cultivate curiousity and see the world through fresh eyes.</p>\n<h3>Tech Lead</h3>\n<p>Role of tech lead is to continue to write code but with the added responsibilities of representing the group to management, vetting our plans for feature delivery, and dealing with a log of the details of the project management process.</p>\n<p>Scales themselves by delegating work effectively without micromanaging. Use their expertise at a larger scale so the whole team gets better.</p>\n<p>Influencing without authority.</p>\n<p>Roles a tech lead plays:</p>\n<ul>\n<li>system architect/business analyst: identify critical systems that need to change and the features that need to be built in order to deliver upcoming projects.</li>\n<li>project planner: break down work into rough deliverables so that the team can work in parallel</li>\n<li>software dev/team leader: write code, communicate challenges, and delegate</li>\n</ul>\n<p>Stone of triumph - achieve recognition only to discover the recognition comes at a heavy price - tech leads rarely get salary/title bumps/training</p>\n<p>The value of planning isn't that you execute the plan perfectly, that you catch every detail beforehand, or that you predict the future; it's that you enforce the self-discipline to think about the project in some depth before diving in and seeing what happens.</p>\n<p>The plan itself is less important than spending time on the act of planning.</p>\n<p>Explain things to upper management in a nonthreatening and non condescending way.</p>\n<p>Your manager isn't great at handing you plum assignments that showcase your talents to the whole organization; she expects <em>you</em> to tell <em>her</em> where these opportunities live.</p>\n<p>Be careful of relying on process to solve problems that are a result of communication or leadership gaps on the team.</p>\n<p>Good tech lead:</p>\n<ul>\n<li>understands the architecture, data flow, how it reflects the products it supports</li>\n<li>is a team player. Don't do all the interesting work yourself. Look at the tricky/boring/annoying areas and unstick them.</li>\n<li>leads technical decisions. Always solicit opinions of the team.</li>\n<li>communicate - your productivity is less important than the productivity of the team</li>\n</ul>\n<h3>Managing People</h3>\n"}},"__N_SSG":true}